ATsupportum/src/Catalogs/Договоры_ат/Договоры_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры_ат</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Контрагенты_ат</owners>
  <attributes>
    <name>Автопролонгация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>CatalogRef.ВидыДоговоров_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатыПоДоговорам_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасторжения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПостоплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитСуммыПриПостоплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВнутреннее</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноВнешнееСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаАрендуОборудования_ат</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>CatalogRef.Проекты_ат</types>
      <types>DocumentRef.ЗаявкаНаАрендуПП_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДанныхДляОпределенияТарифногоПлана</name>
    <type>
      <types>EnumRef.ПериодДанныхДляОпределенияТарифногоПлана_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРеализаций</name>
    <type>
      <types>EnumRef.ПериодичностиРеализаций_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСчетов</name>
    <type>
      <types>EnumRef.ПериодичностиСчетов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостфиксНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРасторжения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодДоговора</name>
    <type>
      <types>EnumRef.РодыДоговоров_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплатыВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПодписанияРеализации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаТарифногоПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ATsupportum/src/Enums/ТипыДоговоров_ат/ТипыДоговоров_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоговоров_ат</name>
  <enumValues>
    <name>АрендаПрограммныхПродуктов</name>
  </enumValues>
  <enumValues>
    <name>АрендаСерверов</name>
  </enumValues>
  <enumValues>
    <name>Интернет</name>
  </enumValues>
  <enumValues>
    <name>ИТС</name>
  </enumValues>
  <enumValues>
    <name>Обслуживание</name>
  </enumValues>
  <enumValues>
    <name>ПродажаПрограммныхПродуктов</name>
  </enumValues>
  <enumValues>
    <name>ПродажаТоваров</name>
  </enumValues>
  <enumValues>
    <name>Разработка</name>
  </enumValues>
  <enumValues>
    <name>Телефония</name>
  </enumValues>
  <enumValues>
    <name>Хостинг</name>
  </enumValues>
  <enumValues>
    <name>ЭДО</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Catalogs/Договоры_ат/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция   ПолучитьИмяРегистраСпецификацииДляТипаДоговора(ТипДоговора) Экспорт
	
	Если ТипДоговора = Перечисления.ТипыДоговоров_ат.АрендаПрограммныхПродуктов Тогда
		
		ИмяРегистра = "СпецификацияДоговоров_АрендаПрограммныхПродуктов_ат";
		
	ИначеЕсли ТипДоговора = Перечисления.ТипыДоговоров_ат.АрендаСерверов Тогда
		
		ИмяРегистра = "СпецификацияДоговоров_АрендаСерверов_ат";
		
	ИначеЕсли ТипДоговора = Перечисления.ТипыДоговоров_ат.Интернет Тогда
		
		ИмяРегистра = "СпецификацияДоговоров_Интернет_ат";
		
	ИначеЕсли ТипДоговора = Перечисления.ТипыДоговоров_ат.ИТС Тогда
		
		ИмяРегистра = "СпецификацияДоговоров_ИТС_ат";
		
	ИначеЕсли ТипДоговора = Перечисления.ТипыДоговоров_ат.Обслуживание Тогда
		
		ИмяРегистра = "СпецификацияДоговоров_Обслуживание_ат";
		
	ИначеЕсли ТипДоговора = Перечисления.ТипыДоговоров_ат.Телефония Тогда
		
		ИмяРегистра = "СпецификацияДоговоров_Телефония_ат";
		
	Иначе
		
		ИмяРегистра = Неопределено;
		
	КонецЕсли;
	
	Возврат ИмяРегистра;
	
КонецФункции

Функция   ПолучитьНовыйНомерДоговора(Договор) Экспорт
	
	Если ЗначениеЗаполнено(Договор.Родитель) Тогда
		
		Возврат ПолучитьНомерПодчиненногоДоговора(Договор);
		
	Иначе
		
		СтруктураНомера = Нумераторы_ат.ПолучитьПредварительныйНомерОбъекта(Договор.Ссылка, Договор.ДатаДоговора); //TODO - реализовать возможносить разделения нумерации по организациям
		
		Если ТипЗнч(СтруктураНомера) = Тип("Структура") И СтруктураНомера.Свойство("Номер") Тогда
			
			Возврат СтруктураНомера;
			
		Иначе
			
			Сообщить("Ошибка определения нового номера договора!", СтатусСообщения.Внимание);
			Возврат 0;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция   ПолучитьНомерПодчиненногоДоговора(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(Договоры_ат.НомерДоговора), 0) КАК МаксимальныйНомер
		|ИЗ
		|	Справочник.Договоры_ат КАК Договоры_ат
		|ГДЕ
		|	НЕ Договоры_ат.ПометкаУдаления
		|	И Договоры_ат.Родитель = &Родитель
		|	И Договоры_ат.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Родитель", Договор.Родитель);
	Запрос.УстановитьПараметр("Ссылка", Договор.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.МаксимальныйНомер + 1;
	
КонецФункции

Процедура ЗаполнитьНаименованияДоговора(Договор) Экспорт
	
	ДопСоглашение = ЭтоДопСоглашение(Договор);
	
	Если ДопСоглашение Тогда
		
		Договор.НаименованиеКраткое = ПредставлениеНомера(Договор, ДопСоглашение)
			+ " от " + Формат(Договор.ДатаДоговора, "ДФ=dd.MM.yy");
		
		Договор.Наименование = "Д/с №" + Договор.НаименованиеКраткое + " к дог. №" + Договор.Родитель.Наименование;
		
		Договор.НаименованиеПолное = "Дополнительное соглашение №"
			+ ПредставлениеНомера(Договор, ДопСоглашение)
			+ " от " + Формат(Договор.ДатаДоговора, "ДФ='dd.MM.yyyy""г.""'")
			+ " к Договору №" + Договор.Родитель.Наименование;
		
	Иначе
		
		Договор.НаименованиеКраткое = ПредставлениеНомера(Договор, ДопСоглашение)
			+ " от " + Формат(Договор.ДатаДоговора, "ДФ=dd.MM.yy");
		
		Договор.Наименование = Договор.НаименованиеКраткое;
		
		Договор.НаименованиеПолное = ПредставлениеНомера(Договор, ДопСоглашение)
				+ " от " + Формат(Договор.ДатаДоговора, "ДФ='dd.MM.yyyy""г.""'");
		
	КонецЕсли;
	
КонецПроцедуры

// ОкончаниеСклонения = (а, у) - (родительный, дательный)
Функция   ПредставлениеДоговораВПадеже(Договор, Полное = Ложь, ОкончаниеСклонения = "") Экспорт
	
	Если ЭтоДопСоглашение(Договор) Тогда
		
		Если Полное И Не ПустаяСтрока(Договор.Родитель.НаименованиеПолное) Тогда
			Если ОкончаниеСклонения = "у" Тогда
				
				Представление = "Дополнительному соглашению №" + Договор.НаименованиеКраткое
					+ " к Договору " + Договор.Родитель.НаименованиеПолное;
				
			ИначеЕсли ОкончаниеСклонения = "а" Тогда
				
				Представление = "Дополнительного соглашения №" + Договор.НаименованиеКраткое
					+ " к Договору " + Договор.Родитель.НаименованиеПолное;
				
			Иначе
				
				Представление = Договор.НаименованиеПолное
				
			КонецЕсли;
			
		Иначе
			
			Представление = Договор.Наименование;
			
		КонецЕсли;
		
	Иначе
		
		Если Полное И Не ПустаяСтрока(Договор.НаименованиеПолное) Тогда
			Представление = "Договор" + ОкончаниеСклонения + " №" + Договор.НаименованиеПолное;
		Иначе
			Представление = "Дог. №" + Договор.НаименованиеКраткое;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция   ПолучитьПолныйНомерДоговора(Договор) Экспорт
	
	ПолныйНомерДоговора = "";
	
	Если ЭтоДопСоглашение(Договор) Тогда
		
		Если Договор.Родитель.НомерДоговора > 0 Тогда
			ПолныйНомерДоговора = Формат(Договор.Родитель.НомерДоговора, "ЧРГ=-; ЧГ=3,0");
		Иначе //!!!!!
			ПолныйНомерДоговора = Строки_КлиентСервер_ат.ПолучитьНомерТикета(Договор.Родитель.Код, Договор.Родитель.ДатаДоговора, Ложь);
		КонецЕсли;
		
		Если Договор.НомерДоговора > 0 Тогда
			ПолныйНомерДоговора = ПолныйНомерДоговора + "#" + Формат(Договор.НомерДоговора, "ЧГ=");
		КонецЕсли;
		
	Иначе
		
		Если Договор.НомерДоговора > 0 Тогда
			ПолныйНомерДоговора = Формат(Договор.НомерДоговора, "ЧРГ=-; ЧГ=3,0");
		Иначе //!!!!!
			ПолныйНомерДоговора = Строки_КлиентСервер_ат.ПолучитьНомерТикета(Договор.Код, Договор.ДатаДоговора, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПолныйНомерДоговора;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("НаименованиеКраткое");
	Поля.Добавить("НаименованиеВнутреннее");
	Поля.Добавить("Родитель");
	Поля.Добавить("Ссылка");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтоДопСоглашение(Данные.Ссылка) Тогда
		
		Если ВнутреннегоИспользования_КлиентСерверПовтИсп_ат.СотрудникОрганизации() Тогда
			
			Если НЕ ПустаяСтрока(Данные.Родитель.НаименованиеВнутреннее) Тогда
				Представление = Данные.Родитель.НаименованиеВнутреннее;
			Иначе
				Представление = Данные.Родитель.Наименование;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(Представление) Тогда
				Представление = Представление + ", ";
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(Данные.НаименованиеВнутреннее) Тогда
				Представление = Представление + Данные.НаименованиеВнутреннее;
			Иначе
				Представление = Представление + "д/с " + Данные.НаименованиеКраткое;
			КонецЕсли;
			
		Иначе
			
			Представление = Данные.Родитель.Наименование + ", д/с " + Данные.НаименованиеКраткое;
			
		КонецЕсли;
		
	Иначе
		
		Если ВнутреннегоИспользования_КлиентСерверПовтИсп_ат.СотрудникОрганизации()
			 И НЕ ПустаяСтрока(Данные.НаименованиеВнутреннее) Тогда
			
			Представление = Данные.НаименованиеВнутреннее;
			
		Иначе
			
			Представление = Данные.Наименование;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция   ПредставлениеНомера(Договор, ЭтоДопСоглашение)
	
	Возврат ?(Договор.НомерДоговора = 0, "б/н",
		?(ЭтоДопСоглашение, "", Договор.ПрефиксНомера)
			//+ Формат(Договор.НомерДоговора, "ЧГ=")
			+ Формат(Договор.НомерДоговора, "ЧРГ=-; ЧГ=3,0")
			+ ?(ЭтоДопСоглашение, "", Договор.ПостфиксНомера));
	
КонецФункции

Функция   ЭтоДопСоглашение(Договор)
	
	Возврат Договор <> Неопределено И НЕ Договор.Родитель.Пустая();
	
КонецФункции

#КонецОбласти
